# DBeam_GetLines

## Description
Return the most recently created beam object

```pascal
FUNCTION DBeam_GetLines : HANDLE;
```

```python

def vs.DBeam_GetLines():
    return HANDLE
```

## Version
Availability: from Vectorworks 2011
## Category
* Spotlight